# Pandas

In [1]:
#used in data cleaning and preparation

In [2]:
#built on top of numpy

In [3]:
import pandas as pd

In [4]:
data = pd.Series([0.25,0.5,0.75,1.0],index=['a','b','c','d'])

In [5]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [8]:
type(data.values)

numpy.ndarray

In [7]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
type(data)

pandas.core.series.Series

In [12]:
data.values.ndim

1

In [13]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [14]:
#explicit indexing the final index is also included

In [18]:
grade_dict={'A':4,
           'A-':3.5,
           'B':3,
           'B-':2.5}

In [19]:
grade_series = pd.Series(grade_dict)

In [20]:
grade_series

A     4.0
A-    3.5
B     3.0
B-    2.5
dtype: float64

In [21]:
marks_dict = {'A':85,
             'A-':80,
             'B':75,
             'B-':60}

In [22]:
marks_series = pd.Series(marks_dict)

In [24]:
marks_series.values

array([85, 80, 75, 60])

# DataFrame

In [25]:
d = pd.DataFrame({'Marks':marks_series,
                 'Grades':grade_series})

In [26]:
d

    Marks  Grades
A      85     4.0
A-     80     3.5
B      75     3.0
B-     60     2.5

In [27]:
d.T

           A    A-     B    B-
Marks   85.0  80.0  75.0  60.0
Grades   4.0   3.5   3.0   2.5

In [28]:
d.values

array([[85. ,  4. ],
       [80. ,  3.5],
       [75. ,  3. ],
       [60. ,  2.5]])

In [29]:
d.index

Index(['A', 'A-', 'B', 'B-'], dtype='object')

In [30]:
d

    Marks  Grades
A      85     4.0
A-     80     3.5
B      75     3.0
B-     60     2.5

In [39]:
d['ScaledMarks']=round((90*(d['Marks']/100)),2)

In [38]:
d

    Marks  Grades  ScaledMarks
A      85     4.0         76.0
A-     80     3.5         72.0
B      75     3.0         68.0
B-     60     2.5         54.0

In [40]:
G = d[d['Marks']>70]

In [41]:
G

    Marks  Grades  ScaledMarks
A      85     4.0         76.5
A-     80     3.5         72.0
B      75     3.0         67.5

# Missing Values

In [45]:
mv = pd.DataFrame([{'a':1,'b':4},{'b':3,'c':4}])

In [46]:
mv

     a  b    c
0  1.0  4  NaN
1  NaN  3  4.0

In [47]:
mv.fillna(0)

     a  b    c
0  1.0  4  0.0
1  0.0  3  4.0

In [48]:
mv

     a  b    c
0  1.0  4  NaN
1  NaN  3  4.0

In [49]:
mv.dropna

<bound method DataFrame.dropna of      a  b    c
0  1.0  4  NaN
1  NaN  3  4.0>

In [51]:
mv

     a  b    c
0  1.0  4  NaN
1  NaN  3  4.0

In [52]:
d

    Marks  Grades  ScaledMarks
A      85     4.0         76.5
A-     80     3.5         72.0
B      75     3.0         67.5
B-     60     2.5         54.0

In [56]:
d.iloc[1:3,1:4:1]

    Grades  ScaledMarks
A-     3.5         72.0
B      3.0         67.5